export const systemIds = {
  // 有修改key值，请在system文件夹中修改对应的key值名称
  quality: "84310513474895948",
  contract: "81869552404688911",
  // contract: '384895866546483224',
  // project: '384895866546483224',
  "integrator-manage-oss": "243420066404753469",
  "project-system-oss": "243421563775475756",
  "portal-oss": "243423160924495882",
  "contract-oss": "261613339485007935",
  "uims-oss": "179368645221163026",
  courses: "153979959378235400",
  // 可信驾驶舱
  cockpit: "167096554103328853",
  "scm-oss": "202474021994926119",
  "psi-oss": "260522474096156746",

  // 可信进度
  schedule: "111875263834587161",
  // 可信采购
  purchase: "82522476633944122",
  //   可信销售
  supplier: "82666604164313112",
  // 供应链交易协同
  "scm-order": "182591202514731045",
  "warning-oss": "268484240314855445",
  "scm-warning": "310974301128110080",
  cms: "156596681134362688",
  // 预警配置
  warning: "263000431838490677",
  // 施工管理
  construction: "114044882112446555",
  // 周报月报
  journal: "92770999912771677",
  "project-analysis": "278920632408875053",
  "company-analysis": "278935451954454566",
  // OSS图标库
  "icon-oss": "233627467213037591",
  // CRM
  crm: "174297437182459959",
  // 在线考试
  exam: "153979800967761949",
  // 消息中心
  message: "190149157363683424",
  // oss消息中心
  "message-oss": "288764695991799814",
  // 可信工程 企业管理
  uims: "199269570018578479",
  // 金融子系统
  "finance-oss": "211949661529894918",
  // scm 账单协同
  "scm-bill": "227263119922143288",
  // 设计管理
  design: "115984652614819867",
  // 质量oss
  "quality-oss": "245580554362282065",
  // scm 协同单位
  "scm-basic": "182590554612203591",
  // scm 结算
  "scm-settle": "182664828995797064",
  // scm 合同
  "scm-contract": "182590974562697223",
  // 采购寻源 scm-purchase-sourcing
  "scm-purchase": "182590770363007005",
  // 费用控制
  fee: "114482962929778703",
  // psi 基础管理
  "psi-basic": "252522681700835378",
  // psi 财务
  "psi-finance": "271754767301222476",
  // psi 订单
  "psi-purOrder": "252496433972895785",
  "psi-supOrder": "252496692748869677",
  // CRM-OSS
  "crm-oss": "197805253117120538",
  // 工程款
  pay: "81208889093156898",
  // 可信金融
  finance: "208327558796734517",
  // iot
  iot: "203179354950242363",
  // iot-oss
  "iot-oss": "204799687155290178",
  // 劳务
  labor: "77938095424557134",
  // 施工日志
  constructionlog: "115980021843157076",
  // 项目信息
  project: "82522199059099734",
  // 安全
  safety: "84346297837977671",
  // 消息中心的跳转用到这份数据，有修改key值，请在system文件夹中修改对应的key值名称
  // 开发平台系统
  "open-platform-oss": "278206791169482793",
  // bim+
  bim: "81164282280046616",

  // 资金往来
  "scm-settle-finance": "227263374860329047",
  // 发票协同
  "scm-settle-invoice": "227263571703209998",
  // 系统工具
  "tools-oss": "262705182754861154",
  // CMS-OSS
  "cms-oss": "164762915621388375",

  // 供应链 - 结算分析
  "scm-analysis": "270233894014558246",
  // 供应链 - 鲁班物资管理
  "scm-materials": "182591463882784800",
  // 采购寻源
  "scm-inquiry": "182590770363007005",
  // oss 任务管理
  "task-oss": "303218113019912212",
  // 筑业
  "construction-industry": "295607457605210176",
  // 任务
  task: "303662734745280606",
  "labor-oss": "312291496319791126",
  // 监管上报
  "regulatory-report": "310811887745118296",
  // 政府设置
  "gov-setting": "82588289080520756",
  "gov-project": "311556021782839389",
  "gov-company": "311560095123111986",
  // 商城管理oss
  "mall-oss": "316622727526232133",
  // 政府监管-进度上报
  "gov-schedule": "320661156341481534",
  // 政府监管-项目动态监管
  "gov-project-manage": "328995784999567447",
  // 检查整改子系统
  check: "329659241818513436",
  // 仓库管理
  "psi-analysis": "252496929970315338",
  // 工业互联网标识管理
  identity: "336201566086545479",
  // 智慧工地子系统
  "construction-site-oss": "339071861117993029",

  "rights-oss": "184711324683505725",

  // 知识库
  kms: "156888900802236460",
  // 低代码管理平台
  "lower-platform": "365261389457313844",
  // 卖家中心oss
  "seller-oss": "366691650774552587",
  "right-oss": "184711324683505725",
  // 铁建成本
  cost: "379778724419399758",
  "yunzhisuan-config": "436275131518550067",
  // 铁建物资
  psi: "390618543697178712",
  // 可信物资
  mat: "394636327829647436",
  // 设备管理
  equip: "395242368422391824",
  // 运营工作台
  "iip-oss": "430042124848115776",
  // 智慧工地
  zhgd: "237718173535821884",
  // 企业工作台
  "iip-company": "430042670271213630",
  "qzjg-enterprise-cockpit": "450694712509071458",
} as const;

/**
 * 获取系统id
 * @param sysName
 */
export function getSystemId(sysName: keyof typeof systemIds) {
  return systemIds[sysName] || "";
}
